; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	spectrograph3 - mode
	thermograph4 - mode
	thermograph0 - mode
	spectrograph2 - mode
	infrared1 - mode
	Star3 - direction
	Star4 - direction
	Star6 - direction
	GroundStation8 - direction
	GroundStation13 - direction
	Star1 - direction
	GroundStation7 - direction
	GroundStation9 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	Star14 - direction
	Star12 - direction
	GroundStation10 - direction
	GroundStation2 - direction
	GroundStation11 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 thermograph4)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 GroundStation11)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation7)
	(supports instrument1 spectrograph3)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 thermograph4)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 Star14)
	(supports instrument3 thermograph4)
	(calibration_target instrument3 GroundStation11)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 GroundStation10)
	(calibration_target instrument3 Star12)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
)
(:goal (and
	(pointing satellite1 Star3)
	(have_image Planet15 spectrograph2)
	(have_image Phenomenon16 spectrograph3)
	(have_image Star17 thermograph0)
	(have_image Star18 infrared1)
))

)

; plan
1. (turn_to satellite1 groundstation0 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 groundstation0)
   goals met: 0 of 5
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 5
3. (calibrate satellite1 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 5
4. (turn_to satellite1 phenomenon16 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon16)
   goals met: 0 of 5
5. (take_image satellite1 phenomenon16 instrument1 spectrograph3)
   added: (have_image phenomenon16 spectrograph3)
   goals met: 1 of 5
6. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 5
7. (calibrate satellite0 instrument0 groundstation7)
   added: (calibrated instrument0)
   goals met: 1 of 5
8. (turn_to satellite0 planet15 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 planet15)
   goals met: 1 of 5
9. (take_image satellite0 planet15 instrument0 spectrograph2)
   added: (have_image planet15 spectrograph2)
   goals met: 2 of 5
10. (turn_to satellite1 star17 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 star17)
   goals met: 2 of 5
11. (take_image satellite1 star17 instrument1 thermograph0)
   added: (have_image star17 thermograph0)
   goals met: 3 of 5
12. (turn_to satellite1 star18 star17)
   deleted: (pointing satellite1 star17)
   added: (pointing satellite1 star18)
   goals met: 3 of 5
13. (take_image satellite1 star18 instrument1 infrared1)
   added: (have_image star18 infrared1)
   goals met: 4 of 5
14. (turn_to satellite1 star3 star18)
   deleted: (pointing satellite1 star18)
   added: (pointing satellite1 star3)
   goals met: 5 of 5
